tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
# Improved shell history for zsh and bash
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Vector graphics library with cross-device output support
brew "cairo"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Console Matrix
brew "cmatrix"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.5"
# Automatic git commit --fixup
brew "git-absorb"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image manipulation
brew "netpbm"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GitHub Markdown previewer
brew "grip"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Network logon cracker which supports many services
brew "hydra"
# Featureful UNIX password cracker
brew "john"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Painless compression and decompression for your terminal
brew "ouch"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "pam-reattach"
# General-purpose scripting language
brew "php", restart_service: true
# Draw UML diagrams
brew "plantuml"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# Autoformat shell script source code
brew "shfmt"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Language for application scale JavaScript development
brew "typescript"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# JavaScript package manager
brew "yarn"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Two-factor authentication software
cask "authy"
# 3D creation suite
cask "blender"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Automation software
cask "keyboard-maestro"
# Open-source keystroke visualizer
cask "keycastr"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Open-source software for live streaming and screen recording
cask "obs"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Retro video game emulation
cask "openemu"
# Collaboration platform for API development
cask "postman"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
mas "AdGuard for Safari", id: 1440147259
mas "ColorSlurp", id: 1287239339
mas "DaVinci Resolve", id: 571213070
mas "Encrypto", id: 935235287
mas "GarageBand", id: 682658836
mas "GeoGebra Classic 6", id: 1182481622
mas "Hidden Bar", id: 1452453066
mas "JSONPeep", id: 1458969831
mas "Magnet", id: 441258766
mas "Notability", id: 360593530
mas "SideNotes", id: 1441958036
mas "The Unarchiver", id: 425424353
mas "WhatFont", id: 1437138382
mas "Xcode", id: 497799835
